bunx.org
#+TITLE: Bunx Loom: DotCortex
#+DESCRIPTION: Bunx launcher manifest
#+AUTHOR: Metsatron
#+LANGUAGE: en
#+PROPERTY: header-args :mkdirp yes :results silent
#+PROPERTY: header-args:bash :comments both
#+PROPERTY: header-args:makefile :comments no :padline no

* Bunx manifest
=bunx= is cache-backed rather than a persistent global installer, so DotCortex manages
user-level launcher wrappers in =~/.local/bin=.
Columns: NAME PACKAGE EXECUTABLE VERSION FLAGS EXTRA

#+BEGIN_SRC text :tangle all/.bunx/manifest/apps.ssv
# ~/DotCortex/all/.bunx/manifest/apps.ssv
# NAME PACKAGE EXECUTABLE VERSION FLAGS EXTRA
opencode-browser @different-ai/opencode-browser opencode-browser "latest" "" ""
#+END_SRC

* Capture managed bunx launchers -> manifest
#+BEGIN_SRC bash :tangle all/.local/bin/bunx-capture :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/bunx-capture
set -euo pipefail

MAN="$HOME/DotCortex/all/.bunx/manifest/apps.ssv"
BIN_DIR="$HOME/.local/bin"

mkdir -p "$(dirname "$MAN")"
touch "$MAN"

tmp_existing="$(mktemp)"
tmp_have="$(mktemp)"
tmp_new="$(mktemp)"

awk '!/^[[:space:]]*#/ && NF { print $1 }' "$MAN" | sort -u >"$tmp_existing"

python3 - "$BIN_DIR" <<'PY' | sort -u >"$tmp_have"
import os
import sys

bin_dir = os.path.expanduser(sys.argv[1])
if not os.path.isdir(bin_dir):
    raise SystemExit(0)

for name in sorted(os.listdir(bin_dir)):
    path = os.path.join(bin_dir, name)
    if not os.path.isfile(path):
        continue
    try:
        with open(path, "r", encoding="utf-8") as fh:
            lines = fh.readlines()
    except Exception:
        continue
    if any(line.strip() == "# dotcortex:bunx-managed" for line in lines[:8]):
        print(name)
PY

comm -13 "$tmp_existing" "$tmp_have" >"$tmp_new"

rm -f "$tmp_existing" "$tmp_have"

if [ ! -s "$tmp_new" ]; then
  rm -f "$tmp_new"
  echo "No new managed bunx launchers to capture into $MAN"
  exit 0
fi

while read -r name; do
  [ -n "$name" ] || continue
  wrapper="$BIN_DIR/$name"
  pkg="$(awk -F': ' '/^# package:/ { print $2; exit }' "$wrapper")"
  exe="$(awk -F': ' '/^# executable:/ { print $2; exit }' "$wrapper")"
  ver="$(awk -F': ' '/^# version:/ { print $2; exit }' "$wrapper")"
  flags="$(awk -F': ' '/^# flags:/ { print $2; exit }' "$wrapper")"
  printf '%s %s %s "%s" "%s" ""\n' "$name" "${pkg:-$name}" "${exe:-$name}" "${ver:-}" "${flags:-}" >>"$MAN"
done <"$tmp_new"

rm -f "$tmp_new"
echo "Updated $MAN"
#+END_SRC

* Plan diff
#+BEGIN_SRC bash :tangle all/.local/bin/bunx-diff :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/bunx-diff
set -euo pipefail

MAN="$HOME/DotCortex/all/.bunx/manifest/apps.ssv"
BIN_DIR="$HOME/.local/bin"

tmp_want="$(mktemp)"
tmp_have="$(mktemp)"

awk '!/^[[:space:]]*#/ && NF { print $1 }' "$MAN" | sort -u >"$tmp_want"

python3 - "$BIN_DIR" <<'PY' | sort -u >"$tmp_have"
import os
import sys

bin_dir = os.path.expanduser(sys.argv[1])
if not os.path.isdir(bin_dir):
    raise SystemExit(0)

for name in sorted(os.listdir(bin_dir)):
    path = os.path.join(bin_dir, name)
    if not os.path.isfile(path):
        continue
    try:
        with open(path, "r", encoding="utf-8") as fh:
            lines = fh.readlines()
    except Exception:
        continue
    if any(line.strip() == "# dotcortex:bunx-managed" for line in lines[:8]):
        print(name)
PY

echo "== bunx plan =="
echo "[to create or update]"
comm -23 "$tmp_want" "$tmp_have" | sed 's/^/  + /'

echo "[to remove]"
comm -13 "$tmp_want" "$tmp_have" | sed 's/^/  - /'

rm -f "$tmp_want" "$tmp_have"
#+END_SRC

* Apply manifest as user launchers
#+BEGIN_SRC bash :tangle all/.local/bin/bunx-apply :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/bunx-apply
set -euo pipefail

MAN="$HOME/DotCortex/all/.bunx/manifest/apps.ssv"
BIN_DIR="$HOME/.local/bin"

ENFORCE="${ENFORCE:-1}"
UNINSTALL="${UNINSTALL:-1}"

mkdir -p "$BIN_DIR"

echo "== bunx apply =="

_emit_norm() {
  awk -v FS='[ \t]+' '
    function dequote(s){
      if (s == "\"\"") return ""
      if (s ~ /^".*"$/) {
        sub(/^"/, "", s)
        sub(/"$/, "", s)
      }
      return s
    }
    $0 ~ /^[ \t]*#/ || NF==0 { next }
    {
      printf "%s|%s|%s|%s|%s|%s\n",
        dequote($1),dequote($2),dequote($3),dequote($4),dequote($5),dequote($6)
    }
  ' "$MAN"
}

declare -A want_names

while IFS='|' read -r name pkg exe version flags extra
do
  [ -n "$name" ] || continue
  want_names["$name"]=1

  pkg="${pkg:-$name}"
  exe="${exe:-$name}"
  pkgspec="$pkg"
  [ -n "$version" ] && pkgspec="$pkg@$version"

  target="$BIN_DIR/$name"
  tmp="$(mktemp)"

  cat >"$tmp" <<EOF
#!/usr/bin/env bash
# dotcortex:bunx-managed
# name: $name
# package: $pkg
# executable: $exe
# version: $version
# flags: $flags
set -euo pipefail
export BUN_INSTALL="\${BUN_INSTALL:-\$HOME/.bun}"
export PATH="\$BUN_INSTALL/bin:\$PATH"
args=()
pkgspec='$pkgspec'
exe='$exe'
flags_csv='$flags'
if [ -n "\$flags_csv" ]; then
  IFS=',' read -ra FF <<<"\$flags_csv"
  for f in "\${FF[@]}"; do
    [ -n "\$f" ] && args+=("\$f")
  done
fi
exec bunx "\${args[@]}" -p "\$pkgspec" "\$exe" "\$@"
EOF

  chmod +x "$tmp"
  mv "$tmp" "$target"
  echo ">> wrote $target"
done < <(_emit_norm)

if [ "$ENFORCE" = "1" ] && [ "$UNINSTALL" = "1" ]; then
  echo "== remove extras =="
  while read -r name; do
    [ -n "$name" ] || continue
    if [ -z "${want_names[$name]:-}" ]; then
      rm -f "$BIN_DIR/$name"
      echo ">> removed $BIN_DIR/$name"
    fi
  done < <(python3 - "$BIN_DIR" <<'PY'
import os
import sys

bin_dir = os.path.expanduser(sys.argv[1])
if not os.path.isdir(bin_dir):
    raise SystemExit(0)

for name in sorted(os.listdir(bin_dir)):
    path = os.path.join(bin_dir, name)
    if not os.path.isfile(path):
        continue
    try:
        with open(path, "r", encoding="utf-8") as fh:
            lines = fh.readlines()
    except Exception:
        continue
    if any(line.strip() == "# dotcortex:bunx-managed" for line in lines[:8]):
        print(name)
PY
)
fi

echo "Done."
#+END_SRC

* Health
#+BEGIN_SRC bash :tangle all/.local/bin/bunx-health :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/bunx-health
set -euo pipefail

BIN_DIR="$HOME/.local/bin"

"$HOME/.local/bin/dotcortex-bun-env" bash -c '
BIN_DIR="$HOME/.local/bin"
echo "BUN       = $(command -v bun || echo missing)"
echo "BUNX      = $(command -v bunx || echo missing)"
echo "Managed wrappers: $(python3 - "$BIN_DIR" <<"PY"
import os
import sys

bin_dir = os.path.expanduser(sys.argv[1])
count = 0
if os.path.isdir(bin_dir):
    for name in os.listdir(bin_dir):
        path = os.path.join(bin_dir, name)
        if not os.path.isfile(path):
            continue
        try:
            with open(path, "r", encoding="utf-8") as fh:
                lines = fh.readlines()
        except Exception:
            continue
        if any(line.strip() == "# dotcortex:bunx-managed" for line in lines[:8]):
            count += 1
print(count)
PY
)"
'
#+END_SRC

* Makefile fragment for Bunx
#+BEGIN_SRC makefile :tangle all/.mk/bunx.mk :padline no
# ~/DotCortex/all/.mk/bunx.mk
.RECIPEPREFIX := |
SHELL := /bin/bash

.PHONY: bunx-capture bunx-diff bunx-sync bunx-apply bunx-health

bunx-capture:
| @chmod +x $(HOME)/.local/bin/bunx-capture 2>/dev/null || true
| $(HOME)/.local/bin/bunx-capture

bunx-diff:
| @chmod +x $(HOME)/.local/bin/bunx-diff 2>/dev/null || true
| $(HOME)/.local/bin/bunx-diff

bunx-sync:
| @chmod +x $(HOME)/.local/bin/bunx-apply 2>/dev/null || true
| ENFORCE=0 UNINSTALL=0 $(HOME)/.local/bin/bunx-apply

bunx-apply:
| @chmod +x $(HOME)/.local/bin/bunx-apply 2>/dev/null || true
| ENFORCE=1 UNINSTALL=1 $(HOME)/.local/bin/bunx-apply

bunx-health:
| @chmod +x $(HOME)/.local/bin/bunx-health 2>/dev/null || true
| $(HOME)/.local/bin/bunx-health
#+END_SRC
