all/.local/bin/bunx-apply
#!/usr/bin/env bash
# Apply manifest as user launchers

# [[file:../../../bunx.org::*Apply manifest as user launchers][Apply manifest as user launchers:1]]
# ~/DotCortex/all/.local/bin/bunx-apply
set -euo pipefail

MAN="$HOME/DotCortex/all/.bunx/manifest/apps.ssv"
BIN_DIR="$HOME/.local/bin"

ENFORCE="${ENFORCE:-1}"
UNINSTALL="${UNINSTALL:-1}"

mkdir -p "$BIN_DIR"

echo "== bunx apply =="

_emit_norm() {
  awk -v FS='[ \t]+' '
    function dequote(s){
      if (s == "\"\"") return ""
      if (s ~ /^".*"$/) {
        sub(/^"/, "", s)
        sub(/"$/, "", s)
      }
      return s
    }
    $0 ~ /^[ \t]*#/ || NF==0 { next }
    {
      printf "%s|%s|%s|%s|%s|%s\n",
        dequote($1),dequote($2),dequote($3),dequote($4),dequote($5),dequote($6)
    }
  ' "$MAN"
}

declare -A want_names

while IFS='|' read -r name pkg exe version flags extra
do
  [ -n "$name" ] || continue
  want_names["$name"]=1

  pkg="${pkg:-$name}"
  exe="${exe:-$name}"
  pkgspec="$pkg"
  [ -n "$version" ] && pkgspec="$pkg@$version"

  target="$BIN_DIR/$name"
  tmp="$(mktemp)"

  cat >"$tmp" <<EOF
#!/usr/bin/env bash
# dotcortex:bunx-managed
# name: $name
# package: $pkg
# executable: $exe
# version: $version
# flags: $flags
set -euo pipefail
export BUN_INSTALL="\${BUN_INSTALL:-\$HOME/.bun}"
export PATH="\$BUN_INSTALL/bin:\$PATH"
args=()
pkgspec='$pkgspec'
exe='$exe'
flags_csv='$flags'
if [ -n "\$flags_csv" ]; then
  IFS=',' read -ra FF <<<"\$flags_csv"
  for f in "\${FF[@]}"; do
    [ -n "\$f" ] && args+=("\$f")
  done
fi
exec bunx "\${args[@]}" -p "\$pkgspec" "\$exe" "\$@"
EOF

  chmod +x "$tmp"
  mv "$tmp" "$target"
  echo ">> wrote $target"
done < <(_emit_norm)

if [ "$ENFORCE" = "1" ] && [ "$UNINSTALL" = "1" ]; then
  echo "== remove extras =="
  while read -r name; do
    [ -n "$name" ] || continue
    if [ -z "${want_names[$name]:-}" ]; then
      rm -f "$BIN_DIR/$name"
      echo ">> removed $BIN_DIR/$name"
    fi
  done < <(python3 - "$BIN_DIR" <<'PY'
import os
import sys

bin_dir = os.path.expanduser(sys.argv[1])
if not os.path.isdir(bin_dir):
    raise SystemExit(0)

for name in sorted(os.listdir(bin_dir)):
    path = os.path.join(bin_dir, name)
    if not os.path.isfile(path):
        continue
    try:
        with open(path, "r", encoding="utf-8") as fh:
            lines = fh.readlines()
    except Exception:
        continue
    if any(line.strip() == "# dotcortex:bunx-managed" for line in lines[:8]):
        print(name)
PY
)
fi

echo "Done."
# Apply manifest as user launchers:1 ends here
