all/.local/bin/bunx-diff
#!/usr/bin/env bash
# Plan diff

# [[file:../../../bunx.org::*Plan diff][Plan diff:1]]
# ~/DotCortex/all/.local/bin/bunx-diff
set -euo pipefail

MAN="$HOME/DotCortex/all/.bunx/manifest/apps.ssv"
BIN_DIR="$HOME/.local/bin"

tmp_want="$(mktemp)"
tmp_have="$(mktemp)"

awk '!/^[[:space:]]*#/ && NF { print $1 }' "$MAN" | sort -u >"$tmp_want"

python3 - "$BIN_DIR" <<'PY' | sort -u >"$tmp_have"
import os
import sys

bin_dir = os.path.expanduser(sys.argv[1])
if not os.path.isdir(bin_dir):
    raise SystemExit(0)

for name in sorted(os.listdir(bin_dir)):
    path = os.path.join(bin_dir, name)
    if not os.path.isfile(path):
        continue
    try:
        with open(path, "r", encoding="utf-8") as fh:
            lines = fh.readlines()
    except Exception:
        continue
    if any(line.strip() == "# dotcortex:bunx-managed" for line in lines[:8]):
        print(name)
PY

echo "== bunx plan =="
echo "[to create or update]"
comm -23 "$tmp_want" "$tmp_have" | sed 's/^/  + /'

echo "[to remove]"
comm -13 "$tmp_want" "$tmp_have" | sed 's/^/  - /'

rm -f "$tmp_want" "$tmp_have"
# Plan diff:1 ends here
